tutorials/compressible/rhoPimpleDyMFoam/annularThermalMixer/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $:innerInlet.k;

boundaryField
{
    innerInlet
    {
        type            fixedValue;
        value           uniform $:innerInlet.k;
    }

    outerInlet
    {
        type            fixedValue;
        value           uniform $:outerInlet.k;
    }

    outlet      { $:outlet.k; }
    staticWalls { $:wall.k; }
    movingWalls { $staticWalls; }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
